[
  {"id":1,"role":"CTO & Co-Founder","company":"DocSend","location":"São José","period":"May 2025 - present","description":"Responsible for the entire conception, architecture and development of DocSend, an ERP system for the accounting sector. As the sole developer and technical lead, I managed the complete product lifecycle from requirements definition to production deployment. Architecture with Java 25 and Spring Boot, interface with Next.js (React 19) and TypeScript, dashboards with Nivo. Infrastructure on Google Cloud, Vercel and Railway. Testcontainers, OpenTelemetry and Micrometer."},
  {"id":2,"role":"CTO & Co-Founder","company":"Aurora's Aesthetic","location":"São José","period":"Oct 2025 - present","description":"As CTO and sole developer, I lead the technology strategy and zero-to-one construction of a SaaS ecosystem for aesthetics clinic management. Stack: Next.js 16, React 19, TypeScript, shadcn/ui, Tailwind CSS, TanStack Query. Backend in Java 25 and Spring Boot, PostgreSQL 18. Observability with OpenTelemetry and Micrometer Tracing."},
  {"id":3,"role":"Senior Systems Analyst","company":"NINA Tecnologia","location":"Palhoça","period":"Jun 2025 - present","description":"Advanced technical support (L3), focal point for critical incident resolution on the patient journey automation platform. Integration and API management, mission-critical systems support (WhatsApp Business API, SMS, Voice), log analysis and infrastructure. N1/N2 team mentorship and LGPD compliance."},
  {"id":4,"role":"Operations and Support Analyst PL","company":"Intelbras","location":"São José","period":"Oct 2020 - Jun 2025","description":"Technical management of WideVoice product (Cloud PABX), interface between critical clients and development. Script automation for support and monitoring. Leadership and mentorship for levels 1 and 2, technical training. Strategic analysis and action plans for clients."},
  {"id":5,"role":"Service Desk Analyst","company":"Dígitro","location":"São José","period":"2018 - 2020","description":"Advanced VoIP troubleshooting in PABX/VoIP systems. SQL Server administration and queries. Technical documentation and service playbooks, standardizing procedures and facilitating escalation."},
  {"id":6,"role":"Service Desk Analyst","company":"Flex Contact Center","location":"Florianópolis","period":"2015 - 2018","description":"Telecom infrastructure: Avaya systems administration and support, network maintenance for large-scale contact center. TOTVS Protheus ERP deployment and support, AYTY CRM support. SQL Server data management."}
]
