[
  {"id":1,"role":"CTO & Co-Founder (Sócio-Fundador)","company":"DocSend","location":"São José","period":"mai 2025 - atual","description":"Responsável por toda a concepção, arquitetura e desenvolvimento do DocSend, um sistema ERP voltado para o setor contábil. Atuando como único desenvolvedor e líder técnico, gerenciei o ciclo de vida completo do produto, desde a definição de requisitos até o deploy em produção. Arquitetura com Java 25 e Spring Boot, interface com Next.js (React 19) e TypeScript, dashboards com Nivo. Infraestrutura em Google Cloud, Vercel e Railway. Testcontainers, OpenTelemetry e Micrometer."},
  {"id":2,"role":"CTO & Co-Founder (Sócio-Fundador)","company":"Aurora's Aesthetic","location":"São José","period":"out 2025 - atual","description":"Como CTO e único desenvolvedor, lidero a estratégia tecnológica e a construção do zero de um ecossistema SaaS voltado à gestão de clínicas de estética. Stack: Next.js 16, React 19, TypeScript, shadcn/ui, Tailwind CSS, TanStack Query. Backend em Java 25 e Spring Boot, PostgreSQL 18. Observabilidade com OpenTelemetry e Micrometer Tracing."},
  {"id":3,"role":"Analista de Sistemas Senior","company":"NINA Tecnologia","location":"Palhoça","period":"jun 2025 - atual","description":"Atuação no nível avançado de suporte técnico (L3), sendo o ponto focal para resolução de incidentes críticos na plataforma de automação da jornada do paciente. Gestão de integrações e APIs, suporte a sistemas de missão crítica (WhatsApp Business API, SMS, Voz), análise de logs e infraestrutura. Mentoria do time N1/N2 e conformidade LGPD."},
  {"id":4,"role":"Analista de Operações e Suporte PL","company":"Intelbras","location":"São José","period":"out 2020 - jun 2025","description":"Gestão técnica do produto WideVoice (PABX Cloud), interface entre clientes críticos e desenvolvimento. Automação com scripts para suporte e monitoramento. Liderança e mentoria para níveis 1 e 2, treinamentos técnicos. Análise estratégica e planos de ação para clientes."},
  {"id":5,"role":"Analista de Service Desk","company":"Dígitro","location":"São José","period":"2018 - 2020","description":"Troubleshooting avançado de VoIP em sistemas PABX/VoIP. Administração e consultas em SQL Server. Criação de documentação técnica e playbooks de atendimento, padronizando procedimentos e facilitando escalonamento."},
  {"id":6,"role":"Analista de Service Desk","company":"Flex Contact Center","location":"Florianópolis","period":"2015 - 2018","description":"Infraestrutura de telecom: administração e suporte em sistemas Avaya, manutenção de redes para contact center de grande escala. Manutenção e implantação do ERP TOTVS Protheus e suporte ao CRM AYTY. Gestão de dados em SQL Server."}
]
