[
  {"id":1,"role":"CTO y Co-Fundador","company":"DocSend","location":"São José","period":"may 2025 - actual","description":"Responsable de toda la concepción, arquitectura y desarrollo de DocSend, un sistema ERP para el sector contable. Como único desarrollador y líder técnico, gestioné el ciclo de vida completo del producto, desde la definición de requisitos hasta el despliegue en producción. Arquitectura con Java 25 y Spring Boot, interfaz con Next.js (React 19) y TypeScript, dashboards con Nivo. Infraestructura en Google Cloud, Vercel y Railway. Testcontainers, OpenTelemetry y Micrometer."},
  {"id":2,"role":"CTO y Co-Fundador","company":"Aurora's Aesthetic","location":"São José","period":"oct 2025 - actual","description":"Como CTO y único desarrollador, lidero la estrategia tecnológica y la construcción desde cero de un ecosistema SaaS para la gestión de clínicas de estética. Stack: Next.js 16, React 19, TypeScript, shadcn/ui, Tailwind CSS, TanStack Query. Backend en Java 25 y Spring Boot, PostgreSQL 18. Observabilidad con OpenTelemetry y Micrometer Tracing."},
  {"id":3,"role":"Analista de Sistemas Senior","company":"NINA Tecnologia","location":"Palhoça","period":"jun 2025 - actual","description":"Actuación en nivel avanzado de soporte técnico (L3), punto focal para resolución de incidentes críticos en la plataforma de automatización de la jornada del paciente. Gestión de integraciones y APIs, soporte a sistemas de misión crítica (WhatsApp Business API, SMS, Voz), análisis de logs e infraestructura. Mentoría del equipo N1/N2 y conformidad LGPD."},
  {"id":4,"role":"Analista de Operaciones y Soporte PL","company":"Intelbras","location":"São José","period":"oct 2020 - jun 2025","description":"Gestión técnica del producto WideVoice (PABX Cloud), interfaz entre clientes críticos y desarrollo. Automatización con scripts para soporte y monitoreo. Liderazgo y mentoría para niveles 1 y 2, capacitaciones técnicas. Análisis estratégico y planes de acción para clientes."},
  {"id":5,"role":"Analista de Service Desk","company":"Dígitro","location":"São José","period":"2018 - 2020","description":"Troubleshooting avanzado de VoIP en sistemas PABX/VoIP. Administración y consultas en SQL Server. Creación de documentación técnica y playbooks de atención, estandarizando procedimientos y facilitando escalamiento."},
  {"id":6,"role":"Analista de Service Desk","company":"Flex Contact Center","location":"Florianópolis","period":"2015 - 2018","description":"Infraestructura de telecom: administración y soporte en sistemas Avaya, mantenimiento de redes para contact center a gran escala. Implantación y soporte del ERP TOTVS Protheus y soporte al CRM AYTY. Gestión de datos en SQL Server."}
]
